### Блок 1 - Pandas начало

In [76]:
import pandas as pd

data = pd.read_csv('module_03_power.csv')

In [77]:
data.head(10)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1
5  Belgium  2011      25.0         1
6  Belgium  2010      22.0         1
7  Belgium  2009      45.0         1
8  Czechia  1998       1.0         1
9  Czechia  1995       7.0         1

In [4]:
data.tail(10)

          country  year  quantity  category
1189472   Vanuatu  2010      5.17        71
1189473   Vanuatu  2009      5.63        71
1189474   Vanuatu  2008      5.63        71
1189475  Viet Nam  2014    300.00        71
1189476  Viet Nam  2013     92.00        71
1189477  Viet Nam  2012     92.00        71
1189478  Viet Nam  2011     87.00        71
1189479  Viet Nam  2010     50.00        71
1189480  Viet Nam  2009     10.00        71
1189481  Viet Nam  2008      1.00        71

In [3]:
data_2 = pd.read_csv('module_03_transactions.csv',sep = ';')

In [35]:
data_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 63 entries, 0 to 62
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Year     60 non-null     float64
 1   Month    60 non-null     float64
 2   ID       60 non-null     object
 3   Product  60 non-null     object
 4   Amount   60 non-null     float64
 5   Price    60 non-null     float64
 6   Total    60 non-null     float64
 7   Cost     60 non-null     float64
dtypes: float64(6), object(2)
memory usage: 4.1+ KB

In [36]:
data_2.head()

     Year  Month    ID Product  Amount   Price    Total    Cost
0  2012.0    1.0  t001      A1     7.0  2904.0  20328.0  1200.0
1  2012.0    1.0  t002      A2     2.0  1896.0   3792.0  1100.0
2  2012.0    2.0  t003      A1     5.0  2904.0  14520.0  1200.0
3  2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
4  2012.0    2.0  t005      A5     3.0  5175.0  15525.0   500.0

In [13]:
len(data)

1189482

In [4]:
%%time
data_3 = pd.read_csv('module_03_power.csv')
len(data_3)

Wall time: 1.04 s

1189482

In [5]:
data_4 = pd.read_csv('module_03_transactions_data.csv')

In [16]:
len(data_4)

60

In [17]:
data_4.head()

   Year  Month    ID Product  Amount  Price  Total  Cost
0  2017      1  t001      A1       7   2904  20328  1200
1  2017      1  t002      A2       2   1896   3792  1100
2  2017      2  t003      A1       5   2904  14520  1200
3  2017      2  t004      A4       1   8618   8618  4200
4  2017      2  t005      A5       3   5175  15525   500

### Блок 2 - Статистика датасета

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1189482 entries, 0 to 1189481
Data columns (total 4 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   country   1189482 non-null  object
 1   year      1189482 non-null  int64
 2   quantity  1189482 non-null  float64
 3   category  1189482 non-null  int64
dtypes: float64(1), int64(2), object(1)
memory usage: 36.3+ MB

In [19]:
data.shape

(1189482, 4)

In [23]:
data.describe()

               year      quantity      category
count  1.189482e+06  1.189482e+06  1.189482e+06
mean   2.002852e+03  1.842648e+05  3.624763e+01
std    7.167345e+00  1.585663e+07  1.809968e+01
min    1.990000e+03 -8.643480e+05  1.000000e+00
25%    1.997000e+03  1.400000e+01  2.400000e+01
50%    2.003000e+03  1.890000e+02  3.500000e+01
75%    2.009000e+03  2.265000e+03  5.100000e+01
max    2.014000e+03  6.680329e+09  7.100000e+01

In [37]:
data_2.shape

(63, 8)

In [22]:
data_4.shape

(60, 8)

In [24]:
data['category'].unique()

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 13, 12, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51,
       52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68,
       69, 70, 71], dtype=int64)

In [26]:
len(data['category'].unique())

71

In [27]:
data['country'].unique()

array(['Austria', 'Belgium', 'Czechia', 'Finland', 'France', 'Greece',
       'Hungary', 'Italy', 'Korea, Republic of', 'Netherlands', 'Romania',
       'Serbia', 'Slovakia', 'Ukraine', 'United Kingdom', 'United States',
       'Brunei Darussalam', 'Bulgaria', 'Canada', 'Chile', 'Croatia',
       'Iran (Islamic Rep. of)', 'Jordan', 'Lithuania', 'Mexico', 'Oman',
       'Other Asia', 'Poland', 'Portugal', 'Spain', 'Sweden',
       'Switzerland', 'T.F.Yug.Rep. Macedonia', 'Turkey', 'Uzbekistan',
       'Argentina', 'Colombia', 'Germany', 'Norway', 'Australia',
       'China, Macao SAR', 'Japan', 'Denmark', 'Ireland', 'Philippines',
       'Bangladesh', 'Eritrea', 'Ethiopia', 'Lesotho', 'Nepal', 'Niger',
       'Pakistan', 'Serbia and Montenegro', 'Tunisia', 'Botswana',
       'Georgia', 'Republic of Moldova', 'Peru', 'South Africa',
       'Iceland', 'Latvia', 'Luxembourg', 'Cuba', 'Kyrgyzstan',
       'Singapore', 'Thailand', 'United Arab Emirates', 'Uruguay',
       'Armenia', 'Fiji', "Korea, Dem.Ppl's.Rep.", 'Russian Federation',
       'Swaziland', 'Zimbabwe', 'Afghanistan', 'Antigua and Barbuda',
       'Azerbaijan', 'Bahamas', 'Belize', 'Bolivia (Plur. State of)',
       'Brazil', 'Burkina Faso', 'Cameroon', 'Cayman Islands',
       'Central African Rep.', 'China', 'Comoros', 'Congo', 'Costa Rica',
       "Côte d'Ivoire", 'Dem. Rep. of the Congo', 'Dominican Republic',
       'Ecuador', 'Egypt', 'El Salvador', 'Estonia',
       'Ethiopia, incl. Eritrea', 'Faeroe Islands', 'French Guiana',
       'Germany, Fed. R. (former)', 'Greenland', 'Guatemala', 'Guinea',
       'Guyana', 'Honduras', 'Indonesia', 'Israel', 'Jamaica', 'Jersey',
       'Kazakhstan', 'Kenya', 'Kuwait', "Lao People's Dem. Rep.",
       'Liberia', 'Libya', 'Malawi', 'Malaysia', 'Maldives', 'Mauritania',
       'Mayotte', 'Morocco', 'Myanmar', 'Namibia', 'New Caledonia',
       'New Zealand', 'Nicaragua', 'Niue', 'Panama', 'Papua New Guinea',
       'Paraguay', 'Sao Tome and Principe', 'Senegal', 'Seychelles',
       'Slovenia', 'Solomon Islands', 'Sri Lanka', 'Sudan (former)',
       'Suriname', 'Togo', 'Tonga', 'Trinidad and Tobago',
       'United Rep. of Tanzania', 'Venezuela (Bolivar. Rep.)',
       'Yugoslavia, SFR (former)', 'Zambia', 'Algeria', 'Curaçao',
       'Gabon', 'Malta', 'Neth. Antilles (former)', 'Sierra Leone',
       'USSR (former)', 'Barbados', 'Benin', 'Chad', 'Djibouti',
       'French Polynesia', 'Ghana', 'Grenada', 'Guadeloupe', 'Haiti',
       'Iraq', 'Kiribati', 'Madagascar', 'Mali', 'Martinique',
       'Pacific Islands (former)', 'Palau', 'St. Helena and Depend.',
       'St. Vincent-Grenadines', 'Syrian Arab Republic', 'Uganda',
       'Yemen', 'Yemen, Dem. (former)', 'Burundi', 'India', 'Mauritius',
       'Mozambique', 'Nigeria', 'Réunion', 'Rwanda', 'Samoa', 'Somalia',
       'St. Kitts-Nevis', 'Viet Nam', 'Belarus', 'Cyprus', 'Cabo Verde',
       'Albania', 'Bahrain', 'Bosnia and Herzegovina',
       'China, Hong Kong SAR', 'Czechoslovakia (former)', 'Angola',
       'Bermuda', 'Bhutan', 'Equatorial Guinea', 'Lebanon',
       'Saudi Arabia', 'St. Lucia', 'St. Pierre-Miquelon',
       'State of Palestine', 'Tajikistan', 'German Dem. R. (former)',
       'Anguilla', 'Mongolia', 'Montenegro', 'Cambodia', 'South Sudan',
       'Sudan', 'Andorra', 'Aruba', 'Bonaire, St Eustatius, Saba',
       'British Virgin Islands', 'Dominica', 'Falkland Is. (Malvinas)',
       'Gambia', 'Gibraltar', 'Qatar', 'Sint Maarten (Dutch part)',
       'Turkmenistan', 'Turks and Caicos Islands', 'Vanuatu',
       'Guinea-Bissau', 'Micronesia (Fed. States of)', 'Timor-Leste',
       'Yemen Arab Rep. (former)', 'American Samoa', 'Liechtenstein',
       'Puerto Rico', 'Cook Islands', 'Guam', 'Guernsey', 'Isle of Man',
       'Marshall Islands', 'Montserrat', 'Nauru',
       'Northern Mariana Islands', 'Tuvalu', 'United States Virgin Is.',
       'Wallis and Futuna Is.',
       'Commonwealth of Independent States (CIS)', 'Antarctic Fisheries'],
      dtype=object)

In [28]:
len(data['country'].unique())

243

In [32]:
data['country'].value_counts()

Germany                                     20422
United States                               19847
Poland                                      19802
Austria                                     17440
Romania                                     17357
                                            ...
Antarctic Fisheries                            90
Pacific Islands (former)                       68
Yemen, Dem. (former)                           61
Yemen Arab Rep. (former)                       45
Commonwealth of Independent States (CIS)       16
Name: country, Length: 243, dtype: int64

In [38]:
data_2['Product'].value_counts()

_5    11
_8     8
_2     8
_4     7
_3     7
A4     5
A5     5
A1     5
A2     2
_6     2
Name: Product, dtype: int64

### Блок 3 - Фильтрация данных

In [45]:
average_level = data['quantity'].mean()
average_level

184264.77005012965

In [41]:
country_stats = data.filter(items = ['country','quantity'])
country_stats.head()

   country  quantity
0  Austria       5.0
1  Austria      17.0
2  Belgium       0.0
3  Belgium       0.0
4  Belgium      35.0

In [49]:
country_stats.query('quantity > 184264.77005012965').head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [50]:
country_stats.query('quantity > {}'.format(average_level)).head()

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [51]:
above_average = country_stats.query('quantity > {}'.format(average_level)).head()

In [52]:
above_average

            country  quantity
3228  United States  367987.0
3229  United States  384439.0
3230  United States  370625.0
3231  United States  310909.0
3232  United States  335418.0

In [57]:
data[data['country'].str.contains('rus', case=False)]['country'].unique()

array(['Brunei Darussalam', 'Russian Federation', 'Belarus', 'Cyprus'],
      dtype=object)

In [58]:
data[data['country'].str.contains('state', case=False)]['country'].unique()

array(['United States', 'Bolivia (Plur. State of)', 'State of Palestine',
       'Micronesia (Fed. States of)', 'United States Virgin Is.',
       'Commonwealth of Independent States (CIS)'], dtype=object)

In [62]:
filtered_countries = data[(data['country'] == 'Russian Federation')|(data['country'] == 'Belarus')]

In [63]:
filtered_countries.head()

                 country  year  quantity  category
6940  Russian Federation  2014   12714.0         3
6941  Russian Federation  2013   11285.0         3
6942  Russian Federation  2012   11302.0         3
6943  Russian Federation  2011    7611.0         3
6944  Russian Federation  2010    9263.0         3

In [64]:
data.loc[100:105, ['country', 'quantity']]

         country  quantity
100  Netherlands     276.0
101  Netherlands     302.0
102  Netherlands     271.0
103  Netherlands     244.0
104  Netherlands     251.0
105  Netherlands     364.0

In [70]:
data.loc[data['year'] == 2014, 'quantity']

2               0.0
26            119.0
45              2.0
57              4.0
86            390.0
             ...
1189411     32015.0
1189436    183892.0
1189461       732.6
1189468         3.0
1189475       300.0
Name: quantity, Length: 56264, dtype: float64

In [72]:
filtered_countries['year'].value_counts()

2010    1215
2008    1203
2009    1192
2011    1191
2012    1183
2014    1171
2013    1163
2007    1150
2006    1146
2005    1040
2003     997
2004     993
2000     984
2002     982
2001     972
1999     942
1998     934
1997     914
1995     898
1996     896
1993     860
1994     857
1992     814
Name: year, dtype: int64

### Блок 4 - Сортировка данных

In [73]:
data.sort_values(by='quantity').head()

              country  year  quantity  category
832375  United States  2000 -864348.0        42
832373  United States  2002 -562414.0        42
832362  United States  2013 -551490.0        42
832380  United States  1995 -493380.0        42
832322        Ukraine  2010 -477263.0        42

In [75]:
data.sort_values(by='quantity', ascending=False)

              country  year      quantity  category
492581  United States  2014  6.680329e+09        31
492267  United States  2014  6.680329e+09        31
492047          China  2014  5.462672e+09        31
492345          China  2014  5.462672e+09        31
122392  USSR (former)  1990  3.257000e+09        12
...               ...   ...           ...       ...
832322        Ukraine  2010 -4.772630e+05        42
832380  United States  1995 -4.933800e+05        42
832362  United States  2013 -5.514900e+05        42
832373  United States  2002 -5.624140e+05        42
832375  United States  2000 -8.643480e+05        42

[1189482 rows x 4 columns]

In [80]:
data.sort_values(by = ['country', 'year', 'quantity'], ascending=[True, True, False]).head()

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31

In [81]:
data.sort_values(by = ['country', 'year', 'quantity'], ascending=[True, True, False], inplace = True)

In [82]:
data

            country  year   quantity  category
835137  Afghanistan  1990  3902100.0        42
492297  Afghanistan  1990   512000.0        31
491412  Afghanistan  1990   400000.0        31
492006  Afghanistan  1990   112000.0        31
491548  Afghanistan  1990    66000.0        31
...             ...   ...        ...       ...
507965     Zimbabwe  2014        0.0        31
609562     Zimbabwe  2014        0.0        35
630816     Zimbabwe  2014        0.0        37
639012     Zimbabwe  2014        0.0        37
871611     Zimbabwe  2014        0.0        48

[1189482 rows x 4 columns]

In [88]:
data_2.sort_values(by = ['Cost'])

      Year  Month    ID Product  Amount   Price    Total    Cost
22  2012.0    6.0  t023      _8    10.0  3760.0  37600.0   200.0
57  2012.0   12.0  t058      _5     2.0  5175.0  10350.0   200.0
18  2012.0    5.0  t019      _3     5.0  1265.0   6325.0   200.0
36  2012.0    9.0  t037      _5     1.0  5175.0   5175.0   200.0
5   2012.0    2.0  t006      _6     4.0  3500.0  14000.0   200.0
..     ...    ...   ...     ...     ...     ...      ...     ...
3   2012.0    2.0  t004      A4     1.0  8618.0   8618.0  4200.0
21  2012.0    5.0  t022      _5     4.0  5175.0  20700.0  4200.0
60     NaN    NaN   NaN     NaN     NaN     NaN      NaN     NaN
61     NaN    NaN   NaN     NaN     NaN     NaN      NaN     NaN
62     NaN    NaN   NaN     NaN     NaN     NaN      NaN     NaN

[63 rows x 8 columns]

In [3]:
data[data['country'].str.contains('toni', case=False)]['country'].unique()

array(['Estonia'], dtype=object)

In [9]:
data[data['country'].str.contains('atv', case=False)]['country'].unique()

array(['Latvia'], dtype=object)

In [14]:
data[data['country'].str.contains('thu', case=False)]['country'].unique()

array(['Lithuania'], dtype=object)

In [72]:
filtered_pribaltic_countries = data[((data['country'] == 'Estonia')|(data['country'] == 'Latvia')|(data['country'] == 'Lithuania'))&(data['year'] >= 2005)&(data['year'] <= 2010)&(data['quantity'] > 0)&((data['category'] == 4)|(data['category'] == 12)|(data['category'] == 21))]

In [73]:
filtered_pribaltic_countries.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 347 entries, 10617 to 253986
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   country   347 non-null    object
 1   year      347 non-null    int64
 2   quantity  347 non-null    float64
 3   category  347 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.6+ KB

In [75]:
filtered_pribaltic_countries['quantity'].summ()

240580.0

In [86]:
filtered_pribaltic_countries_2 = data[((data['country'] == 'Estonia')|(data['country'] == 'Latvia')|(data['country'] == 'Lithuania'))&(data['year'] >= 2005)&(data['year'] <= 2010)&(data['quantity'] > 0)&(data['category'].isin([4, 12, 21]))]

In [87]:
filtered_pribaltic_countries_2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 347 entries, 10617 to 253986
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   country   347 non-null    object
 1   year      347 non-null    int64
 2   quantity  347 non-null    float64
 3   category  347 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 13.6+ KB

In [88]:
filtered_pribaltic_countries_2['quantity'].sum()

240580.0

In [81]:
filtered_pribaltic_countries.sort_values(by = ['quantity'])

          country  year  quantity  category
10617     Estonia  2008       1.0         4
26522   Lithuania  2006       1.0         4
26523   Lithuania  2005       1.0         4
103576  Lithuania  2010       1.0        12
104143  Lithuania  2008       1.0        12
...           ...   ...       ...       ...
248676  Lithuania  2006    4587.0        21
248675  Lithuania  2007    4613.0        21
248674  Lithuania  2008    4655.0        21
243152  Lithuania  2009    4689.0        21
248673  Lithuania  2009    4909.0        21

[347 rows x 4 columns]